# Project 3 art 3 - 'Movies' MySQL Database
- Steven Phillips
- January 11, 2023

## Part 3: Construct and export a MySQL database using your data.
- ETL process on previously saved movie data:
  - prepare data for relational database
  - create new MySQL database 
  - export database as .sql file

#### Prepare the data for a relational database

In [1]:
# imports for preparing data

import pandas as pd

##### Load the data files for preparation

In [4]:
# Open tmdb api merged saved file, save as dataframe, make a copy and preview again

df_tmdb_merged = pd.read_csv("Data/tmdb_results_combined.csv.gz", low_memory = False)
df_tmdb_merged_copy = df_tmdb_merged.copy()
df_tmdb_merged.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.1,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.0,1.0,NaN
4,tt0116748,0.0,/wr0hTHwkYIRC82MwNbhOvqrw27N.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,579396.0,hi,Karobaar,...,0.0,180.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,The Business of Love,Karobaar,0.0,5.5,2.0,NaN

In [5]:
# Open title_basics saved file, save as dataframe, make a copy, and preview again

df_title_basics = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
df_title_basic_copy = df_title_basics.copy()
df_title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

In [6]:
# Open title_basics saved file, save as dataframe, make a copy, and preview again

df_title_ratings = pd.read_csv("Data/title_ratings.csv.gz", low_memory = False)
df_title_ratings_copy = df_title_ratings.copy()
df_title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1926
1  tt0000002            5.8       261
2  tt0000003            6.5      1743
3  tt0000004            5.6       176
4  tt0000005            6.2      2555

In [7]:
# review df info

df_title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144992 entries, 0 to 144991
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          144992 non-null  object
 1   titleType       144992 non-null  object
 2   primaryTitle    144992 non-null  object
 3   originalTitle   144992 non-null  object
 4   isAdult         144992 non-null  int64
 5   startYear       144992 non-null  int64
 6   endYear         0 non-null       float64
 7   runtimeMinutes  144992 non-null  int64
 8   genres          144992 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 10.0+ MB

##### Remove unwanted features from basics and tmdb api data

In [8]:
# drop unwanted basics features

df_title_basics = df_title_basics.drop(columns = ['titleType', 'originalTitle', 'isAdult', 'endYear'])

In [9]:
# review df_tmdb_merged info

df_tmdb_merged.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4470 entries, 0 to 4469
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                4470 non-null   object
 1   adult                  4468 non-null   float64
 2   backdrop_path          1973 non-null   object
 3   belongs_to_collection  251 non-null    object
 4   budget                 4468 non-null   float64
 5   genres                 4468 non-null   object
 6   homepage               231 non-null    object
 7   id                     4468 non-null   float64
 8   original_language      4468 non-null   object
 9   original_title         4468 non-null   object
 10  overview               4116 non-null   object
 11  popularity             4468 non-null   float64
 12  poster_path            3808 non-null   object
 13  production_companies   4468 non-null   object
 14  production_countries   4468 non-null   object
 15  release_date           4432 non-null   object
 16  revenue                4468 non-null   float64
 17  runtime                4468 non-null   float64
 18  spoken_languages       4468 non-null   object
 19  status                 4468 non-null   object
 20  tagline                1260 non-null   object
 21  title                  4468 non-null   object
 22  video                  4468 non-null   float64
 23  vote_average           4468 non-null   float64
 24  vote_count             4468 non-null   float64
 25  certification          824 non-null    object
dtypes: float64(9), object(17)
memory usage: 908.1+ KB

In [10]:
# drop unwanted tmdb api features

df_tmdb_merged = df_tmdb_merged.drop(columns = ['adult', 'backdrop_path', 'belongs_to_collection', 'genres', 'homepage', 'id', 'original_language', 'original_title', 'overview', 'popularity', 'poster_path', 'production_companies', 'production_countries', 'release_date', 'runtime', 'spoken_languages', 'status', 'tagline', 'title', 'video', 'vote_average', 'vote_count'])

In [11]:
df_title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144992 entries, 0 to 144991
Data columns (total 5 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          144992 non-null  object
 1   primaryTitle    144992 non-null  object
 2   startYear       144992 non-null  int64
 3   runtimeMinutes  144992 non-null  int64
 4   genres          144992 non-null  object
dtypes: int64(2), object(3)
memory usage: 5.5+ MB

In [12]:
df_tmdb_merged.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4470 entries, 0 to 4469
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        4470 non-null   object
 1   budget         4468 non-null   float64
 2   revenue        4468 non-null   float64
 3   certification  824 non-null    object
dtypes: float64(2), object(2)
memory usage: 139.8+ KB

##### Normalize the genres feature for the database

In [13]:
# preview the values for splitting

df_title_basics['genres'].value_counts()

Drama                      35534
Comedy                     13253
Comedy,Drama                6380
Horror                      5712
Drama,Romance               4249
                           ...
Comedy,Musical,War             1
Adventure,Fantasy,Music        1
Action,Crime,Music             1
Animation,Music,Romance        1
Crime,Fantasy,Sci-Fi           1
Name: genres, Length: 962, dtype: int64

In [16]:
# create a column of lists of strings for the 

df_title_basics['genres_split'] = df_title_basics['genres'].str.split(',')
df_title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018,122,Drama,[Drama]
3,tt0079644,November 1828,2001,140,"Drama,War","[Drama, War]"
4,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"

In [17]:
# explode the genres_split column

exploded_genres = df_title_basics.explode('genres_split')
exploded_genres.head(10)

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama,Drama
2,tt0069049,The Other Side of the Wind,2018,122,Drama,Drama
3,tt0079644,November 1828,2001,140,"Drama,War",Drama
3,tt0079644,November 1828,2001,140,"Drama,War",War
4,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi",Comedy
4,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi",Horror
4,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi",Sci-Fi

In [18]:
# Create a list of unique genres

unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [19]:
# create new title_genres data frame

title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [20]:
# make the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [21]:
# make replace string genres with new integer ids and drop string genres

title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)

title_genres.head()

      tconst genres_split  genre_id
0  tt0035423       Comedy         5
0  tt0035423      Fantasy         9
0  tt0035423      Romance        18
1  tt0062336        Drama         7
2  tt0069049        Drama         7

In [22]:
title_genres = title_genres.drop(columns = 'genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

##### Convert the genre map dictionary into a dataframe

In [23]:
# manually make dataframe with named cols from the .keys and .values

genre_lookup = pd.DataFrame({'Genre_Name': genre_map.keys(),
                            'Genre_Id':genre_map.values()})
genre_lookup.head()

  Genre_Name  Genre_Id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

##### Additional dataframe preparation and renaming

In [24]:
# copy tmdb api to new name df_tmdb

df_tmdb = df_tmdb_merged.copy()
df_tmdb.head()

     imdb_id      budget  revenue certification
0          0         NaN      NaN           NaN
1  tt0113026  10000000.0      0.0           NaN
2  tt0113092         0.0      0.0           NaN
3  tt0116391         0.0      0.0           NaN
4  tt0116748         0.0      0.0           NaN

In [26]:
# eliminate first row of data - no info

df_tmdb = df_tmdb.iloc[1:,:]
df_tmdb.head()

     imdb_id      budget     revenue certification
1  tt0113026  10000000.0         0.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0116748         0.0         0.0           NaN
5  tt0118694    150000.0  12854953.0            PG

In [27]:
df_title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018,122,Drama,[Drama]
3,tt0079644,November 1828,2001,140,"Drama,War","[Drama, War]"
4,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"

In [28]:
df_title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1926
1  tt0000002            5.8       261
2  tt0000003            6.5      1743
3  tt0000004            5.6       176
4  tt0000005            6.2      2555

In [29]:
# copy genre_lookup with new name df_genre_lookup

df_genre_lookup = genre_lookup.copy()
df_genre_lookup.head()

  Genre_Name  Genre_Id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [30]:
# copy title_genres with new name df_title_genres

df_title_genres = title_genres.copy()
df_title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [31]:
# remove genres and genres_split from df_title_basics

df_title_basics = df_title_basics.drop(columns = ['genres', 'genres_split'])
df_title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0079644,November 1828,2001,140
4,tt0088751,The Naked Monster,2005,100

5 dataframes: df_title_basics, df_title_ratings, df_title_genres, df_tmdb, df_genre_lookup

#### Create the database  - movies - in MySQL

In [32]:
# import mysql tools

import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

connection_str = "mysql+pymysql://root:root@localhost/movies"

In [33]:
# create the engine

engine = create_engine(connection_str)

In [34]:
# Check if the 'movies' database exists. If not, create it.

if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

In [35]:
# create the title_basics table from df_title_basics

df_title_basics.to_sql('title_basics', engine, if_exists = 'replace', index=False)

144992

In [36]:
# preview the first 5 entries of title_basics

q = """SELECT * FROM title_basics LIMIT 5;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0079644,November 1828,2001,140
4,tt0088751,The Naked Monster,2005,100

In [37]:
# create the title_ratings table from df_title_ratings

df_title_ratings.to_sql('title_ratings', engine, if_exists = 'replace', index=False)

940512

In [38]:
# preview the first 5 entries of title_ratings

q = """SELECT * FROM title_ratings LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1926
1  tt0000002            5.8       261
2  tt0000003            6.5      1743
3  tt0000004            5.6       176
4  tt0000005            6.2      2555

In [40]:
# create the title_genres table from df_title_genres

df_title_genres.to_sql('title_genres', engine, if_exists = 'replace', index=False)

251384

In [41]:
# preview the first 5 entries of title_genres

q = """SELECT * FROM title_genres LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [42]:
# create the genres table from df_genre_lookup

df_genre_lookup.to_sql('genres', engine, if_exists = 'replace', index=False)

26

In [43]:
# preview the first 5 entries of genres

q = """SELECT * FROM genres LIMIT 5;"""
pd.read_sql(q, engine)

  Genre_Name  Genre_Id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [44]:
# create the tmdb_data table from df_tmdb

df_tmdb.to_sql('tmdb_data', engine, if_exists = 'replace', index=False)

4469

In [45]:
# preview the first 5 entries of tmdb_data

q = """SELECT * FROM tmdb_data LIMIT 5;"""
pd.read_sql(q, engine)

     imdb_id      budget     revenue certification
0  tt0113026  10000000.0         0.0          None
1  tt0113092         0.0         0.0          None
2  tt0116391         0.0         0.0          None
3  tt0116748         0.0         0.0          None
4  tt0118694    150000.0  12854953.0            PG

##### Show all tables from movies database

In [46]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

##### Designate primary keys for necessary tables

###### Primary key for title_basics table

In [47]:
from sqlalchemy.types import *

key_len = df_title_basics['tconst'].fillna('').map(len).max()
title_len = df_title_basics['primaryTitle'].fillna('').map(len).max()

df_title_basics_schema = {
                'tconst': String(key_len+1),
                'primaryTitle': Text(title_len+1),
                'startYear': Float(),
                'endYear': Float(),
                'runtimeMinutes': Integer()}

In [48]:
df_title_basics.to_sql('title_basics', engine, dtype=df_title_basics_schema, if_exists='replace', index=False)

144992

In [49]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [65]:
# preview the first 5 entries of title_basics

q = """SELECT * FROM title_basics LIMIT 5;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0079644,November 1828,2001.0,140
4,tt0088751,The Naked Monster,2005.0,100

###### Primary key for title_ratings table

In [56]:
from sqlalchemy.types import *

key_len_ratings = df_title_ratings['tconst'].fillna('').map(len).max()


df_title_ratings_schema = {
                "tconst": String(key_len_ratings+1),
                'averageRating': Float(),
                'numVotes': Integer()}

In [57]:
df_title_ratings.to_sql('title_ratings', engine, dtype=df_title_ratings_schema, if_exists='replace', index=False)

940512

In [58]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [66]:
# preview the first 5 entries of title_ratings

q = """SELECT * FROM title_ratings LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1926
1  tt0000002            5.8       261
2  tt0000003            6.5      1743
3  tt0000004            5.6       176
4  tt0000005            6.2      2555

###### Primary key for tmdb_data table

In [59]:
from sqlalchemy.types import *

key_len_tmdb = df_tmdb['imdb_id'].fillna('').map(len).max()
tmdb_len = df_tmdb['certification'].fillna('').map(len).max()

df_tmdb_schema = {
                "imdb_id": String(key_len_tmdb+1),
                "certification": Text(tmdb_len+1),
                'budget': Float(),
                'revenue': Float(),}

In [60]:
df_tmdb.to_sql('tmdb_data', engine, dtype=df_tmdb_schema, if_exists='replace', index=False)

4469

In [61]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [67]:
# preview the first 5 entries of tmdb_data

q = """SELECT * FROM tmdb_data LIMIT 5;"""
pd.read_sql(q, engine)

     imdb_id      budget     revenue certification
0          0         NaN         NaN          None
1  tt0035423  48000000.0  76019000.0         PG-13
2  tt0079644         0.0         0.0          None
3  tt0089067         0.0         0.0          None
4  tt0113026  10000000.0         0.0          None

###### Primary key for genres table

In [62]:
from sqlalchemy.types import *

genre_name_len = df_genre_lookup['Genre_Name'].fillna('').map(len).max()

df_genre_lookup_schema = {
                'Genre_Id': Integer(),
                "Genre_Name": Text(genre_name_len+1)}

In [63]:
df_genre_lookup.to_sql('genres', engine, dtype=df_genre_lookup_schema, if_exists='replace', index=False)

26

In [64]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_Id`);')

In [68]:
# preview the first 5 entries of genres table

q = """SELECT * FROM genres LIMIT 5;"""
pd.read_sql(q, engine)

  Genre_Name  Genre_Id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

###### title_genres is a joiner table and there is no primary key

In [69]:
# preview the first 5 entries of title_genres

q = """SELECT * FROM title_genres LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

##### Show all tables from movies database

In [70]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data